areiter128/SMPS_5G2_MCAL/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_pps.h
/*!Software License Agreement
 * ************************************************************************************************
 *
 * Software License Agreement
 *
 * Copyright © 2018 Microchip Technology Inc.  All rights reserved. Microchip licenses to you the
 * right to use, modify, copy and distribute Software only when embedded on a Microchip 
 * microcontroller or digital signal controller, which is integrated into your product or third 
 * party product (pursuant to the sublicense terms in the accompanying license agreement).
 *
 * You should refer to the license agreement accompanying this Software for additional information 
 * regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR 
 * IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT 
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR 
 * OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT  
 * LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS  
 * OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY  
 * THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *
 * ***********************************************************************************************/
/*!p33SMPS_pps.h
 * ************************************************************************************************
 * Summary:
 * Generic Peripheral Pin Select (PPS) Driver Module (header file)
 *
 * Description:
 * This additional header file contains defines for all required bit-settings of all related registers.
 * This file is an additional header file on top of the generic device header file.
 * 
 * See Also:
 *	p33SMPS_pps.c
 * ***********************************************************************************************/

#ifndef MCAL_P33SMPS_PPS_H
#define MCAL_P33SMPS_PPS_H

// Device header file
#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdint.h> // include standard integer types header file
#include <stdbool.h> // include standard boolean types header file

#include "../p33SMPS_devices.h" // DEVICES header to derive device-dependent properties

// Default definitions for all de4vices

	#define PINMAP_LOCK			(0U)
	#define PINMAP_UNLOCK		(1U)

// Generic declarations for pin numbers for all devices

	#define PIN_RPI0    (0U)
	#define PIN_RPI1    (1U)
	#define PIN_RPI2    (2U)
	#define PIN_RPI3    (3U)
	#define PIN_RPI4    (4U)
	#define PIN_RPI5    (5U)
	#define PIN_RPI6    (6U)
	#define PIN_RPI7    (7U)
	#define PIN_RPI8    (8U)
	#define PIN_RPI9    (9U)
	#define PIN_RPI10   (10U)
	#define PIN_RPI11   (11U)
	#define PIN_RPI12   (12U)
	#define PIN_RPI13   (13U)
	#define PIN_RPI14   (14U)
	#define PIN_RPI15   (15U)
	#define PIN_RPI16   (16U)
	#define PIN_RPI17   (17U)
	#define PIN_RPI18   (18U)
	#define PIN_RPI19   (19U)
	#define PIN_RPI20   (20U)
	#define PIN_RPI21   (21U)
	#define PIN_RPI22   (22U)
	#define PIN_RPI23   (23U)
	#define PIN_RPI24   (24U)
	#define PIN_RPI25   (25U)
	#define PIN_RPI26   (26U)
	#define PIN_RPI27   (27U)
	#define PIN_RPI28   (28U)
	#define PIN_RPI29   (29U)
    #define PIN_RPI30   (30U)
	#define PIN_RPI31   (31U)
	#define PIN_RPI32   (32U)
	#define PIN_RPI33   (33U)
	#define PIN_RPI34   (34U)
	#define PIN_RPI35   (35U)
	#define PIN_RPI36   (36U)
	#define PIN_RPI37   (37U)
	#define PIN_RPI38   (38U)
	#define PIN_RPI39   (39U)
    #define PIN_RPI40   (40U)
    #define PIN_RPI41   (41U)
    #define PIN_RPI42   (42U)
    #define PIN_RPI43   (43U)
    #define PIN_RPI44   (44U)
    #define PIN_RPI45   (45U)
    #define PIN_RPI46   (46U)
    #define PIN_RPI47   (47U)
    #define PIN_RPI48   (48U)
    #define PIN_RPI49   (49U)
    #define PIN_RPI50   (50U)
    #define PIN_RPI51   (51U)
    #define PIN_RPI52   (52U)
    #define PIN_RPI53   (53U)
    #define PIN_RPI54   (54U)
    #define PIN_RPI55   (55U)
    #define PIN_RPI56   (56U)
    #define PIN_RPI57   (57U)
    #define PIN_RPI58   (58U)
    #define PIN_RPI59   (59U)
    #define PIN_RPI60   (60U)
    #define PIN_RPI61   (61U)
    #define PIN_RPI62   (62U)
    #define PIN_RPI63   (63U)
    #define PIN_RPI64   (64U)
    #define PIN_RPI65   (65U)
    #define PIN_RPI66   (66U)
    #define PIN_RPI67   (67U)
    #define PIN_RPI68   (68U)
    #define PIN_RPI69   (69U)
    #define PIN_RPI70   (70U)
    #define PIN_RPI71   (71U)
    #define PIN_RPI72   (72U)
    #define PIN_RPI73   (73U)
    #define PIN_RPI74   (74U)
    #define PIN_RPI75   (75U)
    #define PIN_RPI76   (76U)
    #define PIN_RPI77   (77U)
    #define PIN_RPI78   (78U)
    #define PIN_RPI79   (79U)
    #define PIN_RPI80   (80U)
    #define PIN_RPI81   (81U)
    #define PIN_RPI82   (82U)
    #define PIN_RPI83   (83U)
    #define PIN_RPI84   (84U)
    #define PIN_RPI85   (85U)
    #define PIN_RPI86   (86U)
    #define PIN_RPI87   (87U)
    #define PIN_RPI88   (88U)
    #define PIN_RPI89   (89U)
    #define PIN_RPI90   (90U)
    #define PIN_RPI91   (91U)
    #define PIN_RPI92   (92U)
    #define PIN_RPI93   (93U)
    #define PIN_RPI94   (94U)
    #define PIN_RPI95   (95U)
    #define PIN_RPI96   (96U)
    #define PIN_RPI97   (97U)
    #define PIN_RPI98   (98U)
    #define PIN_RPI99   (99U)
    #define PIN_RPI100  (100U)
    #define PIN_RPI101  (101U)
    #define PIN_RPI102  (102U)
    #define PIN_RPI103  (103U)
    #define PIN_RPI104  (104U)
    #define PIN_RPI105  (105U)
    #define PIN_RPI106  (106U)
    #define PIN_RPI107  (107U)
    #define PIN_RPI108  (108U)
    #define PIN_RPI109  (109U)
    #define PIN_RPI110  (110U)
    #define PIN_RPI111  (111U)
    #define PIN_RPI112  (112U)
    #define PIN_RPI113  (113U)
    #define PIN_RPI114  (114U)
    #define PIN_RPI115  (115U)
    #define PIN_RPI116  (116U)
    #define PIN_RPI117  (117U)
    #define PIN_RPI118  (118U)
    #define PIN_RPI119  (119U)
    #define PIN_RPI120  (120U)
    #define PIN_RPI121  (121U)
    #define PIN_RPI122  (122U)
    #define PIN_RPI123  (123U)
    #define PIN_RPI124  (124U)
    #define PIN_RPI125  (125U)
    #define PIN_RPI126  (126U)
    #define PIN_RPI127  (127U)
    #define PIN_RPI128  (128U)
    #define PIN_RPI129  (129U)
    #define	PIN_RPI130	(130U)
    #define	PIN_RPI131	(131U)
    #define	PIN_RPI132	(132U)
    #define	PIN_RPI133	(133U)
    #define	PIN_RPI134	(134U)
    #define	PIN_RPI135	(135U)
    #define	PIN_RPI136	(136U)
    #define	PIN_RPI137	(137U)
    #define	PIN_RPI138	(138U)
    #define	PIN_RPI139	(139U)
    #define	PIN_RPI140	(140U)
    #define	PIN_RPI141	(141U)
    #define	PIN_RPI142	(142U)
    #define	PIN_RPI143	(143U)
    #define	PIN_RPI144	(144U)
    #define	PIN_RPI145	(145U)
    #define	PIN_RPI146	(146U)
    #define	PIN_RPI147	(147U)
    #define	PIN_RPI148	(148U)
    #define	PIN_RPI149	(149U)
    #define	PIN_RPI150	(150U)
    #define	PIN_RPI151	(151U)
    #define	PIN_RPI152	(152U)
    #define	PIN_RPI153	(153U)
    #define	PIN_RPI154	(154U)
    #define	PIN_RPI155	(155U)
    #define	PIN_RPI156	(156U)
    #define	PIN_RPI157	(157U)
    #define	PIN_RPI158	(158U)
    #define	PIN_RPI159	(159U)
    #define	PIN_RPI160	(160U)
    #define	PIN_RPI161	(161U)
    #define	PIN_RPI162	(162U)
    #define	PIN_RPI163	(163U)
    #define	PIN_RPI164	(164U)
    #define	PIN_RPI165	(165U)
    #define	PIN_RPI166	(166U)
    #define	PIN_RPI167	(167U)
    #define	PIN_RPI168	(168U)
    #define	PIN_RPI169	(169U)
    #define	PIN_RPI170	(170U)
    #define	PIN_RPI171	(171U)
    #define	PIN_RPI172	(172U)
    #define	PIN_RPI173	(173U)
    #define	PIN_RPI174	(174U)
    #define	PIN_RPI175	(175U)
    #define	PIN_RPI176	(176U)
    #define	PIN_RPI177	(177U)
    #define	PIN_RPI178	(178U)
    #define	PIN_RPI179	(179U)
    #define	PIN_RPI180	(180U)
    #define	PIN_RPI181	(181U)
    #define	PIN_RPI182	(182U)
    #define	PIN_RPI183	(183U)
    #define	PIN_RPI184	(184U)
    #define	PIN_RPI185	(185U)
    #define	PIN_RPI186	(186U)
    #define	PIN_RPI187	(187U)
    #define	PIN_RPI188	(188U)
    #define	PIN_RPI189	(189U)
    #define	PIN_RPI190	(190U)
    #define	PIN_RPI191	(191U)
    #define	PIN_RPI192	(192U)
    #define	PIN_RPI193	(193U)
    #define	PIN_RPI194	(194U)
    #define	PIN_RPI195	(195U)
    #define	PIN_RPI196	(196U)
    #define	PIN_RPI197	(197U)
    #define	PIN_RPI198	(198U)
    #define	PIN_RPI199	(199U)
    #define	PIN_RPI200	(200U)
    #define	PIN_RPI201	(201U)
    #define	PIN_RPI202	(202U)
    #define	PIN_RPI203	(203U)
    #define	PIN_RPI204	(204U)
    #define	PIN_RPI205	(205U)
    #define	PIN_RPI206	(206U)
    #define	PIN_RPI207	(207U)
    #define	PIN_RPI208	(208U)
    #define	PIN_RPI209	(209U)
    #define	PIN_RPI210	(210U)
    #define	PIN_RPI211	(211U)
    #define	PIN_RPI212	(212U)
    #define	PIN_RPI213	(213U)
    #define	PIN_RPI214	(214U)
    #define	PIN_RPI215	(215U)
    #define	PIN_RPI216	(216U)
    #define	PIN_RPI217	(217U)
    #define	PIN_RPI218	(218U)
    #define	PIN_RPI219	(219U)
    #define	PIN_RPI220	(220U)
    #define	PIN_RPI221	(221U)
    #define	PIN_RPI222	(222U)
    #define	PIN_RPI223	(223U)
    #define	PIN_RPI224	(224U)
    #define	PIN_RPI225	(225U)
    #define	PIN_RPI226	(226U)
    #define	PIN_RPI227	(227U)
    #define	PIN_RPI228	(228U)
    #define	PIN_RPI229	(229U)
    #define	PIN_RPI230	(230U)
    #define	PIN_RPI231	(231U)
    #define	PIN_RPI232	(232U)
    #define	PIN_RPI233	(233U)
    #define	PIN_RPI234	(234U)
    #define	PIN_RPI235	(235U)
    #define	PIN_RPI236	(236U)
    #define	PIN_RPI237	(237U)
    #define	PIN_RPI238	(238U)
    #define	PIN_RPI239	(239U)
    #define	PIN_RPI240	(240U)
    #define	PIN_RPI241	(241U)
    #define	PIN_RPI242	(242U)
    #define	PIN_RPI243	(243U)
    #define	PIN_RPI244	(244U)
    #define	PIN_RPI245	(245U)
    #define	PIN_RPI246	(246U)
    #define	PIN_RPI247	(247U)
    #define	PIN_RPI248	(248U)
    #define	PIN_RPI249	(249U)
    #define	PIN_RPI250	(250U)
    #define	PIN_RPI251	(251U)
    #define	PIN_RPI252	(252U)
    #define	PIN_RPI253	(253U)
    #define	PIN_RPI254	(254U)
    #define	PIN_RPI255	(255U)


