areiter128/SMPS_5G2_MCAL/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_pps.h
#if defined (__P33SMPS_CH__) || defined (__P33SMPS_CK__)

	// driver definitions for maximum pin number supported
	#define RP_PINNO_MIN		32
	#define RP_PINNO_MAX		181

    #define PPSOUT_DEFAULT	0b0000000   // RPn tied to VSS
    #define PPSOUT_NULL		0b0000000   // RPn tied to VSS
	#define PPSOUT_NONE		0b0000000   // RPn tied to VSS
    #define PPSPIN_NULL         (0U)

/* ---------------------------------------------------------------------------
 *  Enumeration for remappable input pins (values for register RPINRx)
 * ---------------------------------------------------------------------------*/

    #define PPSI_RB0    (32U)
    #define PPSI_RB1    (33U)
    #define PPSI_RB2    (34U)
    #define PPSI_RB3    (35U)
    #define PPSI_RB4    (36U)
    #define PPSI_RB5    (37U)
    #define PPSI_RB6    (38U)
    #define PPSI_RB7    (39U)
    #define PPSI_RB8    (40U)
    #define PPSI_RB9    (41U)
    #define PPSI_RB10   (42U)
    #define PPSI_RB11   (43U)
    #define PPSI_RB12   (44U)
    #define PPSI_RB13   (45U)
    #define PPSI_RB14   (46U)
    #define PPSI_RB15   (47U)

    #define PPSI_RC0    (48U)
    #define PPSI_RC1    (49U)
    #define PPSI_RC2    (50U)
    #define PPSI_RC3    (51U)
    #define PPSI_RC4    (52U)
    #define PPSI_RC5    (53U)
    #define PPSI_RC6    (54U)
    #define PPSI_RC7    (55U)
    #define PPSI_RC8    (56U)
    #define PPSI_RC9    (57U)
    #define PPSI_RC10   (58U)
    #define PPSI_RC11   (59U)
    #define PPSI_RC12   (60U)
    #define PPSI_RC13   (61U)
    #define PPSI_RC14   (62U)
    #define PPSI_RC15   (63U)

    #define PPSI_RD0    (64U)
    #define PPSI_RD1    (65U)
    #define PPSI_RD2    (66U)
    #define PPSI_RD3    (67U)
    #define PPSI_RD4    (68U)
    #define PPSI_RD5    (69U)
    #define PPSI_RD6    (70U)
    #define PPSI_RD7    (71U)
        
    
/* ---------------------------------------------------------------------------
 *  // Enumeration for remappable output pins (offset to register RPOR0)
 * ---------------------------------------------------------------------------*/

    #define PPSO_RB0    (5U)
    #define PPSO_RB1    (6U)
    #define PPSO_RB2    (7U)
    #define PPSO_RB3    (8U)
    #define PPSO_RB4    (9U)
    #define PPSO_RB5    (10U)
    #define PPSO_RB6    (11U)
    #define PPSO_RB7    (12U)
    #define PPSO_RB8    (13U)
    #define PPSO_RB9    (14U)
    #define PPSO_RB10   (15U)
    #define PPSO_RB11   (16U)
    #define PPSO_RB12   (17U)
    #define PPSO_RB13   (18U)
    #define PPSO_RB14   (19U)
    #define PPSO_RB15   (20U)

    #define PPSO_RC0    (21U)
    #define PPSO_RC1    (22U)
    #define PPSO_RC2    (23U)
    #define PPSO_RC3    (24U)
    #define PPSO_RC4    (25U)
    #define PPSO_RC5    (26U)
    #define PPSO_RC6    (27U)
    #define PPSO_RC7    (28U)
    #define PPSO_RC8    (29U)
    #define PPSO_RC9    (30U)
    #define PPSO_RC10   (31U)
    #define PPSO_RC11   (32U)
    #define PPSO_RC12   (33U)
    #define PPSO_RC13   (34U)
    #define PPSO_RC14   (35U)
    #define PPSO_RC15   (36U)

    #define PPSO_RD0    (37U)
    #define PPSO_RD1    (38U)
    #define PPSO_RD2    (39U)
    #define PPSO_RD3    (40U)
    #define PPSO_RD4    (41U)
    #define PPSO_RD5    (42U)
    #define PPSO_RD6    (43U)
    #define PPSO_RD7    (44U)
        
/* ---------------------------------------------------------------------------
 * 	Defines for register direct addressing of available remappable output pins
 * ---------------------------------------------------------------------------*/

    #define PPS_RPO32    (uint8_t*)&RPOR0
    #define PPS_RPO33    (uint8_t*)&RPOR0+1
    #define PPS_RPO34    (uint8_t*)&RPOR1
    #define PPS_RPO35    (uint8_t*)&RPOR1+1
    #define PPS_RPO36    (uint8_t*)&RPOR2
    #define PPS_RPO37    (uint8_t*)&RPOR2+1
    #define PPS_RPO38    (uint8_t*)&RPOR3
    #define PPS_RPO39    (uint8_t*)&RPOR3+1
    #define PPS_RPO40    (uint8_t*)&RPOR4
    #define PPS_RPO41    (uint8_t*)&RPOR4+1
    #define PPS_RPO42    (uint8_t*)&RPOR5
    #define PPS_RPO43    (uint8_t*)&RPOR5+1
    #define PPS_RPO44    (uint8_t*)&RPOR6
    #define PPS_RPO45    (uint8_t*)&RPOR6+1
    #define PPS_RPO46    (uint8_t*)&RPOR7
    #define PPS_RPO47    (uint8_t*)&RPOR7+1
    #define PPS_RPO48    (uint8_t*)&RPOR8
    #define PPS_RPO49    (uint8_t*)&RPOR8+1
    #define PPS_RPO50    (uint8_t*)&RPOR9
    #define PPS_RPO51    (uint8_t*)&RPOR9+1
    #define PPS_RPO52    (uint8_t*)&RPOR10
    #define PPS_RPO53    (uint8_t*)&RPOR10+1
    #define PPS_RPO54    (uint8_t*)&RPOR11
    #define PPS_RPO55    (uint8_t*)&RPOR11+1
    #define PPS_RPO56    (uint8_t*)&RPOR12
    #define PPS_RPO57    (uint8_t*)&RPOR12+1
    #define PPS_RPO58    (uint8_t*)&RPOR13
    #define PPS_RPO59    (uint8_t*)&RPOR13+1
    #define PPS_RPO60    (uint8_t*)&RPOR14
    #define PPS_RPO61    (uint8_t*)&RPOR14+1
    #define PPS_RPO62    (uint8_t*)&RPOR15
    #define PPS_RPO63    (uint8_t*)&RPOR15+1
    #define PPS_RPO64    (uint8_t*)&RPOR16
    #define PPS_RPO65    (uint8_t*)&RPOR16+1
    #define PPS_RPO66    (uint8_t*)&RPOR17
    #define PPS_RPO67    (uint8_t*)&RPOR17+1
    #define PPS_RPO68    (uint8_t*)&RPOR18
    #define PPS_RPO69    (uint8_t*)&RPOR18+1
    #define PPS_RPO70    (uint8_t*)&RPOR19
    #define PPS_RPO71    (uint8_t*)&RPOR19+1
    #define PPS_RPO72    (uint8_t*)&RPOR20
    #define PPS_RPO73    (uint8_t*)&RPOR20+1
    #define PPS_RPO74    (uint8_t*)&RPOR21
    #define PPS_RPO75    (uint8_t*)&RPOR21+1
    #define PPS_RPO76    (uint8_t*)&RPOR22
    #define PPS_RPO78    (uint8_t*)&RPOR22+1
    #define PPS_RPO79    (uint8_t*)&RPOR23
    #define PPS_RPO80    (uint8_t*)&RPOR23+1

    // Virtual pins
    #define PPS_VITUAL_RPO176   (uint8_t*)&RPOR24
    #define PPS_VITUAL_RPO177   (uint8_t*)&RPOR24+1
    #define PPS_VITUAL_RPO178   (uint8_t*)&RPOR25
    #define PPS_VITUAL_RPO179   (uint8_t*)&RPOR25+1
    #define PPS_VITUAL_RPO180   (uint8_t*)&RPOR26
    #define PPS_VITUAL_RPO181   (uint8_t*)&RPOR26+1

/* ---------------------------------------------------------------------------
 * 	defines for register addresses for available output sources
 *  The pin number 0...181 will be the value written to the registers 
 *  declared here
 * 
 * TABLE: OUTPUT SELECTION FOR REMAPPABLE PINS (RPn)
 * ---------------------------------------------------------------------------*/
        
    #define PPSOUT_VSS      (uint8_t)0b000000 // RPn tied to VSS

