areiter128/SMPS_5G2_MCAL/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_pps.h
    #define PPSOUT_U1TX     (uint8_t)0b000001 // RPn tied to UART1 Transmit
    #define PPSOUT_U1RTS    (uint8_t)0b000010 // RPn tied to UART1 Request-to-Send
    #define PPSOUT_U2TX     (uint8_t)0b000011 // RPn tied to UART2 Transmit
    #define PPSOUT_U2RTS    (uint8_t)0b000100 // RPn tied to UART2 Request-to-Send
    #define PPSOUT_U3TX     (uint8_t)0b011011 // RPn tied to UART3 Transmit
    #define PPSOUT_U3RTS    (uint8_t)0b011100 // RPn tied to UART3 Request-to-Send

    #define PPSOUT_SDO1     (uint8_t)0b000101 // RPn tied to SPI1 Data Output
    #define PPSOUT_SCK1     (uint8_t)0b000110 // RPn tied to SPI1 Clock Output
    #define PPSOUT_SS1      (uint8_t)0b000111 // RPn tied to SPI1 Slave Select
    #define PPSOUT_SDO2     (uint8_t)0b001000 // RPn tied to SPI2 Data Output
    #define PPSOUT_SCK2     (uint8_t)0b001001 // RPn tied to SPI2 Clock Output
    #define PPSOUT_SS2      (uint8_t)0b001010 // RPn tied to SPI2 Slave Select
    #define PPSOUT_SDO3     (uint8_t)0b001011 // RPn tied to SPI3 Data Output
    #define PPSOUT_SCK3     (uint8_t)0b001100 // RPn tied to SPI3 Clock Output
    #define PPSOUT_SS3      (uint8_t)0b001101 // RPn tied to SPI3 Slave Select            

    #define PPSOUT_REFCLKO  (uint8_t)0b001110 // RPn tied to Reference Clock Output
    #define PPSOUT_OCM1     (uint8_t)0b001111 // RPn tied to SCCP1 Output
    #define PPSOUT_OCM2     (uint8_t)0b010000 // RPn tied to SCCP2 Output
    #define PPSOUT_OCM3     (uint8_t)0b010001 // RPn tied to SCCP3 Output
    #define PPSOUT_OCM4     (uint8_t)0b010010 // RPn tied to SCCP4 Output
    #define PPSOUT_OCM5     (uint8_t)0b010011 // RPn tied to SCCP5 Output
    #define PPSOUT_OCM6     (uint8_t)0b010100 // RPn tied to SCCP6 Output
    #define PPSOUT_CAN1     (uint8_t)0b010101 // RPn tied to CAN1 Output
    #define PPSOUT_CMP1     (uint8_t)0b010111 // RPn tied to Comparator 1 Output
    #define PPSOUT_CMP2     (uint8_t)0b011000 // RPn tied to Comparator 2 Output
    #define PPSOUT_CMP3     (uint8_t)0b011001 // RPn tied to Comparator 3 Output
      
    #define PPSOUT_PWM4H    (uint8_t)0b100010 // RPn tied to PWM4H Output
    #define PPSOUT_PWM4L    (uint8_t)0b100011 // RPn tied to PWM4L Output
    #define PPSOUT_PWMEA    (uint8_t)0b100100 // RPn tied to PWM Event A Output
    #define PPSOUT_PWMEB    (uint8_t)0b100101 // RPn tied to PWM Event B Output
    #define PPSOUT_QEICMP1  (uint8_t)0b100110 // RPn tied to QEI1 Comparator Output
    #define PPSOUT_QEICMP2  (uint8_t)0b100111 // RPn tied to QEI2 Comparator Output
    #define PPSOUT_CLC1OUT  (uint8_t)0b101000 // RPn tied to CLC1 Output
    #define PPSOUT_CLC2OUT  (uint8_t)0b101001 // RPn tied to CLC2 Output
    #define PPSOUT_OCM7     (uint8_t)0b101010 // RPn tied to SCCP7 Output
    #define PPSOUT_OCM8     (uint8_t)0b101011 // RPn tied to SCCP8 Output
    #define PPSOUT_PWMEC    (uint8_t)0b101100 // RPn tied to PWM Event C Output
    #define PPSOUT_PWMED    (uint8_t)0b101101 // RPn tied to PWM Event D Output
    #define PPSOUT_PTGTRG24 (uint8_t)0b101110 // PTG Trigger Output 24
    #define PPSOUT_PTGTRG25 (uint8_t)0b101111 // PTG Trigger Output 25
    #define PPSOUT_SENT1OUT (uint8_t)0b110000 // RPn tied to SENT1 Output
    #define PPSOUT_SENT2OUT (uint8_t)0b110001 // RPn tied to SENT2 Output
    #define PPSOUT_MCCP9A   (uint8_t)0b110010 // RPn tied to MCCP9 Output A
    #define PPSOUT_MCCP9B   (uint8_t)0b110011 // RPn tied to MCCP9 Output B
    #define PPSOUT_MCCP9C   (uint8_t)0b110100 // RPn tied to MCCP9 Output C
    #define PPSOUT_MCCP9D   (uint8_t)0b110101 // RPn tied to MCCP9 Output D
    #define PPSOUT_MCCP9E   (uint8_t)0b110110 // RPn tied to MCCP9 Output E
    #define PPSOUT_MCCP9F   (uint8_t)0b110111 // RPn tied to MCCP9 Output F        
    #define PPSOUT_CLC3OUT  (uint8_t)0b110010 // RPn tied to CLC3 Output
    #define PPSOUT_CLC4OUT  (uint8_t)0b110011 // RPn tied to CLC4 Output
      
    #define PPSOUT_U1DTR    (uint8_t)0b110100 // Data Terminal Ready Output 1
    #define PPSOUT_U2DTR    (uint8_t)0b110101 // Data Terminal Ready Output 2
    #define PPSOUT_U3DTR    (uint8_t)0b111111 //RPn tied to UART3 DTR   
            
/* ---------------------------------------------------------------------------
 * 	defines for register addresses for available input sources
 *  The pin number 0...181 will be the value written to the registers 
 *  declared here
 * 
 * TABLE: SELECTABLE INPUT SOURCES (MAPS INPUT TO FUNCTION)
 * ---------------------------------------------------------------------------*/

    #define PPSIN_INT1	   (uint8_t*)&RPINR0+1  // External Interrupt 1
    #define PPSIN_INT2	   (uint8_t*)&RPINR1    // External Interrupt 2
    #define PPSIN_INT3	   (uint8_t*)&RPINR1+1  // External Interrupt 3
    #define PPSIN_T1CK	   (uint8_t*)&RPINR2+1  // Timer1 External Clock
    #define PPSIN_TCKI1	   (uint8_t*)&RPINR3    // SCCP Timer1
    #define PPSIN_ICM1	   (uint8_t*)&RPINR3+1  // SCCP Capture 1
    #define PPSIN_TCKI2	   (uint8_t*)&RPINR4    // SCCP Timer2
    #define PPSIN_ICM2	   (uint8_t*)&RPINR4+1  // SCCP Capture 2
    #define PPSIN_TCKI3	   (uint8_t*)&RPINR5    // SCCP Timer3
    #define PPSIN_ICM3	   (uint8_t*)&RPINR5+1  // SCCP Capture 3
    #define PPSIN_TCKI4	   (uint8_t*)&RPINR6    // SCCP Timer4	
    #define PPSIN_ICM4	   (uint8_t*)&RPINR6+1  // SCCP Capture 4
    #define PPSIN_TCKI5	   (uint8_t*)&RPINR7    // SCCP Timer5	
    #define PPSIN_ICM5	   (uint8_t*)&RPINR7+1  // SCCP Capture 5
    #define PPSIN_TCKI6	   (uint8_t*)&RPINR8    // SCCP Timer6	
    #define PPSIN_ICM6	   (uint8_t*)&RPINR8+1  // SCCP Capture 6
    #define PPSIN_TCKI7	   (uint8_t*)&RPINR9    // SCCP Timer7	
    #define PPSIN_ICM7	   (uint8_t*)&RPINR9+1  // SCCP Capture 7
    #define PPSIN_TCKI8	   (uint8_t*)&RPINR10   // SCCP Timer8	
    #define PPSIN_ICM8	   (uint8_t*)&RPINR10+1 // SCCP Capture 8
    #define PPSIN_OCFA	   (uint8_t*)&RPINR11   // xCCP Fault A
    #define PPSIN_OCFB	   (uint8_t*)&RPINR11+1 // xCCP Fault B
    #define PPSIN_PCI8	   (uint8_t*)&RPINR12   // PWM PCI 8
    #define PPSIN_PCI9	   (uint8_t*)&RPINR12+1 // PWM PCI 9
    #define PPSIN_PCI10	   (uint8_t*)&RPINR13   // PWM PCI 10
    #define PPSIN_PCI11	   (uint8_t*)&RPINR13+1 // PWM PCI 11
    #define PPSIN_QEIA1	   (uint8_t*)&RPINR14   // QEI1 Input A
    #define PPSIN_QEIB1	   (uint8_t*)&RPINR14+1 // QEI1 Input B
    #define PPSIN_QEINDX1  (uint8_t*)&RPINR15   // QEI1 Index 1
    #define PPSIN_QEIHOM1  (uint8_t*)&RPINR15+1 // QEI1 Home	1
    #define PPSIN_QEIA2	   (uint8_t*)&RPINR16   // QEI2 Input A
    #define PPSIN_QEIB2	   (uint8_t*)&RPINR16+1 // QEI2 Input B
    #define PPSIN_QEINDX2  (uint8_t*)&RPINR17   // QEI2 Index 1
    #define PPSIN_QEIHOM2  (uint8_t*)&RPINR17+1 // QEI2 Home 1
    #define PPSIN_U1RX	   (uint8_t*)&RPINR18   // UART1 Receive	
    #define PPSIN_U1DSR	   (uint8_t*)&RPINR18+1 // UART1 Data-Set Ready	
    #define PPSIN_U2RX     (uint8_t*)&RPINR19   // UART2 Receive	
    #define PPSIN_U2DSR    (uint8_t*)&RPINR19+1 // UART2 Data-Set-Ready	
    #define PPSIN_SDI1	   (uint8_t*)&RPINR20   // SPI1 Data Input
    #define PPSIN_SCK1IN   (uint8_t*)&RPINR20+1 // SPI1 Clock Input
    #define PPSIN_SS1      (uint8_t*)&RPINR21   // SPI1 Slave Select 
    #define PPSIN_REFOI	   (uint8_t*)&RPINR21+1 // Reference Clock Input
    #define PPSIN_SDI2     (uint8_t*)&RPINR22   // SPI2 Data Input
    #define PPSIN_SCK2IN   (uint8_t*)&RPINR22+1 // SPI2 Clock Input
    #define PPSIN_SS2      (uint8_t*)&RPINR23   // SPI2 Slave Select 
    #define PPSIN_CAN1RX   (uint8_t*)&RPINR26   // CAN1 Input 
    #define PPSIN_U3RX	   (uint8_t*)&RPINR27   // UART3 Receive	
    #define PPSIN_U3DSR    (uint8_t*)&RPINR27+1 // UART3 Data-Set-Ready	
    #define PPSIN_SDI3     (uint8_t*)&RPINR29   // SPI3 Data Input
    #define PPSIN_SCK3IN   (uint8_t*)&RPINR29+1 // SPI3 Clock Input
    #define PPSIN_SS3      (uint8_t*)&RPINR30   // SPI3 Slave Select 
    #define PPSIN_TCKI9    (uint8_t*)&RPINR32+1 // MCCP Timer9	
    #define PPSIN_ICM9     (uint8_t*)&RPINR33   // MCCP Capture 9
    #define PPSIN_OCFC     (uint8_t*)&RPINR37   // xCCP Fault C
    #define PPSIN_PCI17    (uint8_t*)&RPINR37+1 // PWM Input 17
    #define PPSIN_PCI18    (uint8_t*)&RPINR38   // PWM Input 18
    #define PPSIN_PCI12    (uint8_t*)&RPINR42   // PWM Input 12
    #define PPSIN_PCI13    (uint8_t*)&RPINR42+1 // PWM Input 13
    #define PPSIN_PCI14    (uint8_t*)&RPINR43   // PWM Input 14
    #define PPSIN_PCI15    (uint8_t*)&RPINR43+1 // PWM Input 15
    #define PPSIN_PCI16    (uint8_t*)&RPINR44   // PWM Input 16
    #define PPSIN_SENT1    (uint8_t*)&RPINR44+1 // SENT1 Input	
    #define PPSIN_SENT2    (uint8_t*)&RPINR45   // SENT2 Input	
    #define PPSIN_CLCINA   (uint8_t*)&RPINR45+1 // CLC Input A
    #define PPSIN_CLCINB   (uint8_t*)&RPINR46   // CLC Input B
    #define PPSIN_CLCINC   (uint8_t*)&RPINR46+1 // CLC Input C
    #define PPSIN_CLCIND   (uint8_t*)&RPINR47   // CLC Input D
    #define PPSIN_ADCTRG   (uint8_t*)&RPINR47+1 // ADC Trigger Input (ADTRIG31)
    #define PPSIN_OCFD	   (uint8_t*)&RPINR48   // xCCP Fault D
    #define PPSIN_U1CTS	   (uint8_t*)&RPINR48+1 // UART1 Clear-to-Send	
    #define PPSIN_U2CTS	   (uint8_t*)&RPINR49   // UART2 Clear-to-Send	
    #define PPSIN_U3CTS	   (uint8_t*)&RPINR49+1 // UART3 Clear-to-Send	
    
    /* Specific declarations for virtual, remappable pins */
    #if defined (__P33SMPS_CH_SLV__)

        #define PPS_RPV0            (170U)
        #define PPS_RPV1            (171U)
        #define PPS_RPV2            (172U)
        #define PPS_RPV3            (173U)
        #define PPS_RPV4            (174U)
        #define PPS_RPV5            (175U)

    #elif defined (__P33SMPS_CH_MSTR__)
    
        #define PPS_RPV0            (176U)
        #define PPS_RPV1            (177U)
        #define PPS_RPV2            (178U)
        #define PPS_RPV3            (179U)
        #define PPS_RPV4            (180U)
        #define PPS_RPV5            (181U)

    #endif

#elif defined (__P33SMPS_CK__)

    

#else

    #pragma message "error: === p33SMPS_pps: selected device type not supported ==="

#endif

// PROTOTYPES FOR p33SMPS_pps.c
    
extern volatile uint16_t smpsPPS_RemapOutput(volatile uint8_t pinno, volatile uint8_t peripheral);
extern volatile uint16_t smpsPPS_UnmapOutput(volatile uint8_t pinno);
extern volatile uint16_t smpsPPS_RemapInput(volatile uint8_t pinno, volatile uint8_t* peripheral);
extern volatile uint16_t smpsPPS_UnmapInput(volatile uint8_t* peripheral);
extern volatile uint16_t smpsPPS_LockIO(void);
extern volatile uint16_t smpsPPS_UnlockIO(void);

#endif // end of MCAL_P33SMPS_PPS_H
// End of File 
    